---
kind: type
id: T:Autodesk.Revit.DB.CurtainGridSet
source: html/adc86636-024c-9035-700f-e7c43442a9f8.htm
---
# Autodesk.Revit.DB.CurtainGridSet

A set that can contain any type of object.

## Syntax (C#)
```csharp
public class CurtainGridSet : APIObject,
	IEnumerable
```